app/helpers/bookings_helper.rb

def boatsMethod
boats = []
Boat.all.each do |boat|
---
SELECT "boats".* FROM "boats"