app/controllers/boats_controller.rb

  def index
    @boats = Boat.all
---
SELECT "boats".* FROM "boats"

  def show
  @boat = Boat.find(params[:id])
---
SELECT  "boats".* FROM "boats" WHERE "boats"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def edit
    @boat = Boat.find(params[:id])
---
SELECT  "boats".* FROM "boats" WHERE "boats"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]

def create
  p 'BOATPARAMS'
  p boat_params
  	@boat = Boat.new(boat_params)
  	@user = User.find_by_id(current_user.id)
  	p @boat
  	@boat.user = @user
    	@boat.save
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "boats" ("created_at", "updated_at", "name", "capacity", "location", "user_id") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", "2018-05-14 15:38:43.232273"], ["updated_at", "2018-05-14 15:38:43.232273"], ["name", "Titanic"], ["capacity", 34], ["location", "San Antonio, TX, USA"], ["user_id", 1]]

  def update
  	@boat = Boat.find(params[:id])
  	@boat.update({
  		name: params[:boat][:name],
  		location: params[:boat][:location],
  		capacity: params[:boat][:capacity]

  	})
---
SELECT  "boats".* FROM "boats" WHERE "boats"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]
UPDATE "boats" SET "location" = ?, "updated_at" = ? WHERE "boats"."id" = ?  [["location", "San Antonio, TX, USA"], ["updated_at", "2018-05-17 19:22:00.801662"], ["id", 8]]

def destroy
    # to do: be able to delete a boat from all boats collection
    @boat = Boat.find(params[:id])
    @boat.destroy
---
SELECT  "boats".* FROM "boats" WHERE "boats"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
DELETE FROM "boats" WHERE "boats"."id" = ?  [["id", 2]]

    def set_boat
      @boat = Boat.find(params[:id])
---
SELECT  "boats".* FROM "boats" WHERE "boats"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]