app/controllers/bookings_controller.rb

  def index
    @booking = Booking.new
    @bookings = Booking.all
---
SELECT "bookings".* FROM "bookings"

  def create
    # existing = Booking.where(booking_params).first
     # if existing
     #  respond_to do |format|
     #    # format.html { redirect_to bookings_url, notice: "#{existing.boat.name} has already been assigned to #{existing.job.name}"}
     # end
    # else
      @booking = Booking.new(booking_params)
      if @booking.save
---
INSERT INTO "bookings" ("boat_id", "job_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["boat_id", 1], ["job_id", 1], ["created_at", "2018-05-18 18:19:07.028248"], ["updated_at", "2018-05-18 18:19:07.028248"]]

def destroy
  @booking = Booking.find(params[:id])
  @booking.destroy
---
SELECT  "bookings".* FROM "bookings" WHERE "bookings"."id" = ? LIMIT ?  [["id", 41], ["LIMIT", 1]]
DELETE FROM "bookings" WHERE "bookings"."id" = ?  [["id", 41]]