app/models/booking.rb

SELECT  "boats".* FROM "boats" WHERE "boats"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def boat
    Boat.find(self.boat_id).name